Python 3.11.5 (tags/v3.11.5:cce6ba9, Aug 24 2023, 14:38:34) [MSC v.1936 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code05-04.py
100보다 크군요.
거짓이면 이 문장도 보이겠죠?
프로그램 끝

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code05-05.py
정수를 입력하세요 : 125
홀수를 입력했군요.

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code05-06.py
50보다 크고 100보다 작군요.

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code05-08.py
점수를 입력하세요 : 60
D
학점입니다. ^^
for i in range(0, 3, 1):
    print("%d : 안녕하세요? for문을 공부 중입니다." %i)

    
0 : 안녕하세요? for문을 공부 중입니다.
1 : 안녕하세요? for문을 공부 중입니다.
2 : 안녕하세요? for문을 공부 중입니다.
for i in range(0, 3):
    print("%d : 안녕하세요? for문을 공부 중입니다." %i)

    
0 : 안녕하세요? for문을 공부 중입니다.
1 : 안녕하세요? for문을 공부 중입니다.
2 : 안녕하세요? for문을 공부 중입니다.
for i in range(2, -1, -1):
    print("%d : 안녕하세요? for문을 공부 중입니다." % i)

    
2 : 안녕하세요? for문을 공부 중입니다.
1 : 안녕하세요? for문을 공부 중입니다.
0 : 안녕하세요? for문을 공부 중입니다.
for i in range(2, -1):
    print("%d : 안녕하세요? for문을 공부 중입니다." %i)

    

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-02(2).py
1에서 10까지의 합계 : 55

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-03.py
500과 1000 사이에 있는 홀수의 합계 : 187500

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-04.py
값을 입력하세요 : 100
1에서 100까지의 합계 : 5050

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-05.py
시작값을 입력하세요 : 2
끝값을 입력하세요 : 300
증가값을 입력하세요 : 3
2에서 300까지 3씩 증가시킨 값의 합계 : 15050
i, dan = 0, 0
dan = int(input("단을 입력하세요: "))
단을 입력하세요: 7
i, dan = 0, 0

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-06.py
단을 입력하세요 : 7
9 X 7 = 63
8 X 7 = 56
7 X 7 = 49
6 X 7 = 42
5 X 7 = 35
4 X 7 = 28
3 X 7 = 21
2 X 7 = 14
1 X 7 =  7
for i in range(0, 3, 1) :
    for k in range(0, 2, 1) :
        print("파이썬은 꿀잼입니다. ^^ (i값 : %d, k값 : %d)" % (i, k))

        
파이썬은 꿀잼입니다. ^^ (i값 : 0, k값 : 0)
파이썬은 꿀잼입니다. ^^ (i값 : 0, k값 : 1)
파이썬은 꿀잼입니다. ^^ (i값 : 1, k값 : 0)
파이썬은 꿀잼입니다. ^^ (i값 : 1, k값 : 1)
파이썬은 꿀잼입니다. ^^ (i값 : 2, k값 : 0)
파이썬은 꿀잼입니다. ^^ (i값 : 2, k값 : 1)

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-07.py
## 2단 ##
2 X 1 =  2
2 X 2 =  4
2 X 3 =  6
2 X 4 =  8
2 X 5 = 10
2 X 6 = 12
2 X 7 = 14
2 X 8 = 16
2 X 9 = 18

## 3단 ##
3 X 1 =  3
3 X 2 =  6
3 X 3 =  9
3 X 4 = 12
3 X 5 = 15
3 X 6 = 18
3 X 7 = 21
3 X 8 = 24
3 X 9 = 27

## 4단 ##
4 X 1 =  4
4 X 2 =  8
4 X 3 = 12
4 X 4 = 16
4 X 5 = 20
4 X 6 = 24
4 X 7 = 28
4 X 8 = 32
4 X 9 = 36

## 5단 ##
5 X 1 =  5
5 X 2 = 10
5 X 3 = 15
5 X 4 = 20
5 X 5 = 25
5 X 6 = 30
5 X 7 = 35
5 X 8 = 40
5 X 9 = 45

## 6단 ##
6 X 1 =  6
6 X 2 = 12
6 X 3 = 18
6 X 4 = 24
6 X 5 = 30
6 X 6 = 36
6 X 7 = 42
6 X 8 = 48
6 X 9 = 54

## 7단 ##
7 X 1 =  7
7 X 2 = 14
7 X 3 = 21
7 X 4 = 28
7 X 5 = 35
7 X 6 = 42
7 X 7 = 49
7 X 8 = 56
7 X 9 = 63

## 8단 ##
8 X 1 =  8
8 X 2 = 16
8 X 3 = 24
8 X 4 = 32
8 X 5 = 40
8 X 6 = 48
8 X 7 = 56
8 X 8 = 64
8 X 9 = 72

## 9단 ##
9 X 1 =  9
9 X 2 = 18
9 X 3 = 27
9 X 4 = 36
9 X 5 = 45
9 X 6 = 54
9 X 7 = 63
9 X 8 = 72
9 X 9 = 81


= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-08.py
# 2단 ## 3단 ## 4단 ## 5단 ## 6단 ## 7단 ## 8단 ## 9단 #
 2 X  1 =  2 3 X  1 =  3 4 X  1 =  4 5 X  1 =  5 6 X  1 =  6 7 X  1 =  7 8 X  1 =  8 9 X  1 =  9
 2 X  2 =  4 3 X  2 =  6 4 X  2 =  8 5 X  2 = 10 6 X  2 = 12 7 X  2 = 14 8 X  2 = 16 9 X  2 = 18
 2 X  3 =  6 3 X  3 =  9 4 X  3 = 12 5 X  3 = 15 6 X  3 = 18 7 X  3 = 21 8 X  3 = 24 9 X  3 = 27
 2 X  4 =  8 3 X  4 = 12 4 X  4 = 16 5 X  4 = 20 6 X  4 = 24 7 X  4 = 28 8 X  4 = 32 9 X  4 = 36
 2 X  5 = 10 3 X  5 = 15 4 X  5 = 20 5 X  5 = 25 6 X  5 = 30 7 X  5 = 35 8 X  5 = 40 9 X  5 = 45
 2 X  6 = 12 3 X  6 = 18 4 X  6 = 24 5 X  6 = 30 6 X  6 = 36 7 X  6 = 42 8 X  6 = 48 9 X  6 = 54
 2 X  7 = 14 3 X  7 = 21 4 X  7 = 28 5 X  7 = 35 6 X  7 = 42 7 X  7 = 49 8 X  7 = 56 9 X  7 = 63
 2 X  8 = 16 3 X  8 = 24 4 X  8 = 32 5 X  8 = 40 6 X  8 = 48 7 X  8 = 56 8 X  8 = 64 9 X  8 = 72
 2 X  9 = 18 3 X  9 = 27 4 X  9 = 36 5 X  9 = 45 6 X  9 = 54 7 X  9 = 63 8 X  9 = 72 9 X  9 = 81

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-09.py
1에서 10까지의 합계 : 55

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-12.py
더할 첫 번째 수를 입력하세요 : 55
더할 두 번째 수를 입력하세요 : 22
55 + 22 = 77
더할 첫 번째 수를 입력하세요 : 77
더할 두 번째 수를 입력하세요 : 128
77 + 128 = 205
더할 첫 번째 수를 입력하세요 : 0
0을 입력해 반복문을 탈출했습니다.
>>> while True:
...     a = input("더할 첫번째 수를 입력하세요: ")
...     if a == '$':
...         print("$를 입력하여 반복문을 탈출했습니다.")
...         break
...     b = int(input("더할 두번째 수를 입력하세요: "))
...     hap = int(a) + b
...     print("%d + %d = %d" % (int(a), b, hap))
... 
...     
더할 첫번째 수를 입력하세요: 3
더할 두번째 수를 입력하세요: 2
3 + 2 = 5
더할 첫번째 수를 입력하세요: $
$를 입력하여 반복문을 탈출했습니다.
>>> while True:
...     a = input("더할 첫번째 수를 입력하세요: ")
...     if a == '$':
...         print("$를 입력하여 반복문을 탈출했습니다.")
...         break
...     else:
...         a = int(a)
...     b = int(input("더할 두번째 수를 입력하세요:"))
...     hap = int(a) + b
...     print("%d + %d = %d" % (int(a), b, hap))
... 
...     
더할 첫번째 수를 입력하세요: 3
더할 두번째 수를 입력하세요:2
3 + 2 = 5
더할 첫번째 수를 입력하세요: 5
더할 두번째 수를 입력하세요:5
5 + 5 = 10
더할 첫번째 수를 입력하세요: $
$를 입력하여 반복문을 탈출했습니다.
>>> 
= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\0921_2020301035_배철규code06-14.py
1~100의 합계(3의 배수 제외) : 3367
