Python 3.11.5 (tags/v3.11.5:cce6ba9, Aug 24 2023, 14:38:34) [MSC v.1936 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\1012_2020301035_배철규self_study_9-2.py
첫 번째 수를 입력하세요 : 34
계산을 입력하세요(+, -, *, /, **) : /
두 번째 수를 입력하세요 : 0
0으로는 나누면 안됩니다. ㅠㅠ
계산불가

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\1012_2020301035_배철규self_study_9-2.py
첫 번째 수를 입력하세요 : 34
계산을 입력하세요(+, -, *, /, **) : /
두 번째 수를 입력하세요 : 2
## 계산기 : 34 / 2 = 17

= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\1019_2020301035_배철규self_study_9-2-2.py
첫 번째 수를 입력하세요 : 34
계산을 입력하세요(+, -, *, /, **) : +
두 번째 수를 입력하세요 : 5
## 계산기 : 34 + 5 = 39
계속하려면 Y를 눌러주세요: y
첫 번째 수를 입력하세요 : 33
계산을 입력하세요(+, -, *, /, **) : /
두 번째 수를 입력하세요 : 0
0으로는 나누면 안됩니다. ㅠㅠ
계산불가
계속하려면 Y를 눌러주세요: Y
첫 번째 수를 입력하세요 : 23
계산을 입력하세요(+, -, *, /, **) : **
두 번째 수를 입력하세요 : 3
## 계산기 : 23 ** 3 = 12167
계속하려면 Y를 눌러주세요: 
프로그램을 종료합니다.
>>> 
= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\1019_2020301035_배철규code09-07-02.py
메인 시작에서 a값 20
func1()에서 a값 Hi
func2()에서 a값 Hi
메인 끝에서 a값 Hi
>>> 
= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\1019_2020301035_배철규code09-09.py
multi()에서 돌려준 값 ==> 300, -100
>>> 
= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\1019_2020301035_배철규code09-11.py
매개변수가 2개인 함수를 호출한 결과 ==> 30
매개변수가 3개인 함수를 호출한 결과 ==> 60
>>> 
= RESTART: C:\Users\skuniv\Documents\오픈소스프로그래밍_ㅂㅊㄱ\1019_2020301035_배철규code09-12-2.py
매개변수가 2개인 함수를 호출한 결과 ==> 30
매개변수가 10개인 함수를 호출한 결과 ==> 550
>>> def dic_func(**para) :
...     for k in para.keys() :
...         print("%s --> %d명입니다." % (k, para[k]))
... 
...         
>>> dic_func(트와이스 = 9, 소녀시대 = 7, 걸스데이 = 4, 블랙핑크 = 4, 방탄소년단 = 7)
트와이스 --> 9명입니다.
소녀시대 --> 7명입니다.
걸스데이 --> 4명입니다.
블랙핑크 --> 4명입니다.
방탄소년단 --> 7명입니다.
>>> 
= RESTART: C:/Users/skuniv/Documents/오픈소스프로그래밍_ㅂㅊㄱ/1019_2020301035_배철규code09-13.py
** 로또 추첨을 시작합니다. ** 

추첨된 로또 번호 ==> 12 19 25 33 36 38 
